{
  "applied_job_title": "HR Data Analyst",
  "applied_job_description": "Responsibilities:\nData Analysis and Reporting:\n•\tCollect, analyze, and interpret HR data from various sources such as employee surveys, performance evaluations, turnover rates, and recruitment metrics.\n•\tPrepare and present reports, dashboards, and visualizations to summarize HR metrics (time-to-hire, cost-per-hire, candidate sourcing channels, and recruitment funnel analytics) and trends for management review and decision-making.\nTrend Identification, forecasting and benchmarking:\n•\tIdentify patterns, trends, and insights within HR data to inform strategic initiatives and improve HR processes.\n•\tUse historical data and statistical methods to forecast future HR trends, such as workforce demographics, turnover rates, and talent needs.\n•\tConduct benchmarking analysis to compare HR metrics and practices against industry standards and competitors.\nHR Metrics Development:\n•\tDevelop and maintain key performance indicators (KPIs) and metrics to measure the effectiveness of HR programs and initiatives.\nProcess Improvement:\n•\tIdentify opportunities for process improvement and efficiency gains within HR operations. Recommend and implement process improvements to streamline HR and recruitment workflows, reduce time-to-fill, enhance candidate experience, and optimize resource allocation.\nChange Management and Strategic Planning:\n•\tSupport HR and recruitment teams through organizational changes, system implementations, and process improvements: conducting change impact assessments, and facilitate stakeholder communication.\n•\tProvide analytical support to HR leadership in developing strategic workforce plans, talent acquisition strategies, and succession planning initiatives.\nHR Technology Management:\n•\tParticipating in the configuration of our new ATS and supporting business decisions by providing ATS reports and statistics\n•\tAssist in the evaluation, implementation, and maintenance of HR technology systems and tools, such as HRIS (Human Resources Information Systems) and EPMS (Enterprise Performance Management System).\nRequirements:\n•\tMinimum 3 years of experience in business analysis, process audit, in a Recruitment environment, HR Development, Strategy, Consulting, HR solutions etc;\n•\tRecruitment skills necessary to understand business implications and management needs;\n•\tATS / HRIS / EPMS knowledge is essential;\n•\tFrench & English skills - professional level.",
  "candidate_name": "Arwa LASSOUED",
  "candidate_job_title": "Manager Data Steward – Technology Acceleration Center « TAC – PWC »",
  "candidate_experience": "5 years",
  "candidate_background": "Highly skilled data professional with experience in data management, analysis, and HR data analysis. Proficient in various data tools and technologies, with a strong background in statistical analysis and data visualization.",
  "requirements_analysis": [
    "Minimum 3 years of experience in business analysis, process audit, in a Recruitment environment, HR Development, Strategy, Consulting, HR solutions etc;",
    "Recruitment skills necessary to understand business implications and management needs;",
    "ATS / HRIS / EPMS knowledge is essential;",
    "French & English skills - professional level."
  ],
  "match_results": {
    "technical_skills": "Proficient in various data tools and technologies including PowerBI, Alteryx, MDM, SAP, SalesForce, Workday, JIRA, QlikView, Talend. Experience with HR-related tools like Workday.",
    "experience_level": "More than 3 years of experience in relevant fields, including HR data analysis and data management.",
    "education": "Diplôme national d’ingénieur en statistique et analyse d’information from Ecole Supérieure de la Statistique et de l’Analyse de l’Information (ESSAI), Tunis.",
    "certifications": "Agile Scrum Master – Product Owner, DATAMINING certification."
  },
  "scoring_weights": {
    "Business Intelligence": 0.27,
    "Data & Analytics": 0.27,
    "Industry-Specific": 0.26,
    "English B2 Level": 0.1,
    "French B2 Level": 0.1
  },
  "score_details": [
    {
      "section": "Business Intelligence",
      "raw_score": 4.0,
      "weight": 27.0,
      "weighted_score": 0.216
    },
    {
      "section": "Data & Analytics",
      "raw_score": 4.0,
      "weight": 27.0,
      "weighted_score": 0.216
    },
    {
      "section": "Industry-Specific",
      "raw_score": 4.0,
      "weight": 26.0,
      "weighted_score": 0.208
    },
    {
      "section": "English B2 Level",
      "raw_score": 3.0,
      "weight": 10.0,
      "weighted_score": 0.06
    },
    {
      "section": "French B2 Level",
      "raw_score": 5.0,
      "weight": 10.0,
      "weighted_score": 0.1
    }
  ],
  "total_weighted_score": 8.0,
  "strengths": [
    "Strong background in data analysis and HR data analysis.",
    "Proficient in various data tools and technologies including PowerBI, Alteryx, and Workday.",
    "Experience in developing and automating HR dashboards and reports.",
    "Fluent in French and competent in English."
  ],
  "gaps": [
    "English language skills are competent but not fluent, which might be a minor gap for some roles requiring advanced English proficiency."
  ],
  "rationale": "The candidate, Arwa LASSOUED, has a strong background in data analysis and HR data analysis with relevant experience and technical skills. She has developed and automated HR dashboards and reports, and is proficient in tools like PowerBI and Workday. Her fluency in French and competence in English are assets for the role. The only minor gap identified is her English language proficiency being competent rather than fluent.",
  "risk": "The risk is low as the candidate's skills and experience closely match the job requirements. The minor gap in English proficiency is not considered significant enough to impact overall performance.",
  "next_steps": [
    "Technical interview focusing on data analysis and HR data analysis capabilities.",
    "Assessment of English language proficiency to gauge its impact on job performance.",
    "Reference checks to verify previous experience and achievements."
  ]
}